{
    "link":"www.thedailystar.net/lifestyle/news/basics-bike-modification-1950213",
    "categories":"Lifestyle",
    "date_published":"2020-08-25T00:00:00+06:00",
    "date_modified":"2020-08-25T00:00:00+06:00",
    "headline":"Basics of bike modification",
    "short_description":"Remember when Bon Jovi said “I’m a cowboy, on a steel horse I ride”? Perhaps, he liked motorbikes almost as much as we do. And when you customise them to suit your needs, be it performance or cosmetic, they truly take on a unique identity, and that is usually why they are cherished possessions of their owners.\n\n",
    "full_description":"Remember when Bon Jovi said \"I'm a cowboy, on a steel horse I ride\"? Perhaps, he liked motorbikes almost as much as we do. And when you customise them to suit your needs, be it performance or cosmetic, they truly take on a unique identity, and that is usually why they are cherished possessions of their owners.\nThere are a lot of options out there, and here's what you should know before you start tinkering with your bike.\nIf you like your bike to stand out in terms of aesthetics, it's probably a good idea to apply a customised paintjob with a colour that appeals to your taste. Remember that chrome paints will make it look shiny, but also consider the possibility of scratches on chrome. If a custom paintjob is too expensive for you, there's always vinyl wraps available in a huge variety of matte and glossy colours and finishes.\nAlex, a stunt performer and owner of a bike servicing shop, shared some tips for beginning modders.\n\"You want to start small. Headlights, tail lights, handlebars are the ones you should start with,\" he said.\nThe wheel lights will give you a very sci-fi vibe to your ride, the neon accent lights under the chassis will give you a retro or ghostly glamour. These beginner customisations will cost you around Tk 10,000.\nYou also have the option to customise the turn signals. The built-in ones usually stick out and are not all that flashy. Installing a custom LED signal will ensure that it's visible from a distance, in addition to fitting in well with the custom body modifications that you have just added.\nA more practical customisation is the Fender Eliminator kit. The fenders that come on new motorcycles are bulky, ugly, and generally ruin the appearance of a motorcycle, and their elimination gives you a slim and edgy look that young riders appreciate. On top of that, the eliminator kit ensures that the rear light and turn lights are fit properly.\n\n\nIf you are more concerned about performance, your focus should be on mods like air filters and suspensions. Standard filters will certainly do the job but a performance air filter will ensure that your engine can get more air for combustion, thus boosting its performance. They might be a bit expensive, but their performance output will be more than worth it.\nPerformance suspensions on the other hand, which are configured to your specifications will improve the bike's handling, responsiveness, braking and overall ride quality.\nHowever, it is very important to note that a number of engine and muffler customisations are not permitted, and therefore might get you into trouble with the police, which is why it is highly recommended that you consult a licensed mechanic before modding your bike. They will have all the information you need.\n\n\nAdding a frame slider and an engine guard is as good idea as any. The engine guards are basically a bar of steel that separate the engine from the ground. In case of a crash, it ensures that there are no scratches or heavy brunt on the engine. A frame slider on the other hand, are small devices on the sides that are similar to roll bars. They keep the frame away from the ground in the event that the bike tips over.\nIf you want to really spice it up, you should go for a customised fork. But remember, this will not only change the overall look of the bike, it will also change the performance and the balance of the vehicle.\nLast but not least, are the tyres, seats and handlebars. Leather accessories might look good, but the lighter ones will also scratch easily and will require regular conditioning treatment. Tyres will not only change the look, but will directly influence the balance and performance, as tires dictate how much grip your bike has with the road. Always choose tyres that support the terrain you drive on. Avoid tyres that do not properly fit with your wheels since they will affect the handling.\nAnd remember, safety should always be a priority, even with mods.\nPhoto Courtesy: Haunt Ryderz"
 }